Revit 2024 API
ParameterFilterRuleFactory.CreateLessOrEqualRule Method
Overload List
Name | Description
CreateLessOrEqualRule(ElementId, ElementId)
 Creates a filter rule that determines whether ElementId values from the document are less than or equal to a certain value.
CreateLessOrEqualRule(ElementId, Int32)
 Creates a filter rule that determines whether integer values from the document are less than or equal to a certain value.
CreateLessOrEqualRule(ElementId, String)
 Creates a filter rule that determines whether strings from the document are less than or equal to a certain value.
CreateLessOrEqualRule(ElementId, Double, Double)
 Creates a filter rule that determines whether double-precision values from the document are less than or equal to a certain value.
CreateLessOrEqualRule(ElementId, String, Boolean) |  Obsolete.
 Creates a filter rule that determines whether strings from the document are less than or equal to a certain value.
See Also
ParameterFilterRuleFactory Class
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace